<script lang="ts" setup>
import { useData } from 'vitepress'
import { computed, ref, onMounted } from 'vue'
import { countWord } from '../untils/functions'

const { page } = useData()
const date = computed(
  () => new Date(page.value.lastUpdated!)
)

const wordCount = ref(0)
const imageCount = ref(0)

const wordTime = computed(() => {
    return ((wordCount.value / 275) * 60)
})

const imageTime = computed(() => {
    const n = imageCount.value
    if (imageCount.value <= 10) {
        // 等差数列求和
        return n * 13 + (n * (n - 1)) / 2
    }
    return 175 + (n - 10) * 3
})

// 阅读时间
const readTime = computed(() => {
    return Math.ceil((wordTime.value + imageTime.value) / 60)
})


function analyze() {
    document.querySelectorAll('.meta-des').forEach(v => v.remove())
    const docDomContainer = window.document.querySelector('#VPContent')
    const imgs = docDomContainer?.querySelectorAll<HTMLImageElement>(
        '.content-container .main img'
    )
    imageCount.value = imgs?.length || 0
    const words = docDomContainer?.querySelector('.content-container .main')?.textContent || ''
    wordCount.value = countWord(words)
}

onMounted(() => {
    // 初始化时执行一次
    analyze()
})
</script>

<template>
    <div class="word">
        <p>
            <svg t="1755688245357" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="29706" width="17" height="17"><path transform="translate(0, 50)" d="M512 64.383234C264.7878 64.383234 64.383234 264.7878 64.383234 512s200.404567 447.616766 447.616766 447.616766 447.616766-200.404567 447.616766-447.616766S759.2122 64.383234 512 64.383234zM691.046707 601.523353 512 601.523353c-24.721118 0-44.761677-20.040559-44.761677-44.761677 0 0 0 0 0-0.001022s0 0 0-0.001022L467.238323 288.191617c0-24.721118 20.040559-44.761677 44.761677-44.761677 24.721118 0 44.761677 20.040559 44.761677 44.761677l0 223.808383 134.28503 0c24.721118 0 44.761677 20.040559 44.761677 44.761677S715.767824 601.523353 691.046707 601.523353z" p-id="29707" fill="#707070"></path></svg>
            更新: {{ date.toLocaleDateString() }}&nbsp;&nbsp;&nbsp;&nbsp;
            <svg t="1724571760788" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="6125" width="16" height="16"><path d="M204.8 0h477.866667l273.066666 273.066667v614.4c0 75.093333-61.44 136.533333-136.533333 136.533333H204.8c-75.093333 0-136.533333-61.44-136.533333-136.533333V136.533333C68.266667 61.44 129.706667 0 204.8 0z m307.2 607.573333l68.266667 191.146667c13.653333 27.306667 54.613333 27.306667 61.44 0l102.4-273.066667c6.826667-20.48 0-34.133333-20.48-40.96s-34.133333 0-40.96 13.653334l-68.266667 191.146666-68.266667-191.146666c-13.653333-27.306667-54.613333-27.306667-68.266666 0l-68.266667 191.146666-68.266667-191.146666c-6.826667-13.653333-27.306667-27.306667-47.786666-20.48s-27.306667 27.306667-20.48 47.786666l102.4 273.066667c13.653333 27.306667 54.613333 27.306667 61.44 0l75.093333-191.146667z" fill="#777777" p-id="6126"></path><path d="M682.666667 0l273.066666 273.066667h-204.8c-40.96 0-68.266667-27.306667-68.266666-68.266667V0z" fill="#E0E0E0" opacity=".619" p-id="6127"></path></svg>
            字数: {{ wordCount }} 字&nbsp;&nbsp;&nbsp;&nbsp;
            <svg t="1755689261801" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="80801" width="16" height="16"><path d="M56.886692 574.452913C56.886692 413.890224 144.207765 265.472843 285.912516 185.148833a465.617578 465.617578 0 0 1 458.080091 0c141.733194 80.32401 229.025824 228.712947 229.025824 389.30408C973.046874 822.763326 767.970348 1024 514.966783 1024 261.963219 1024 56.886692 822.734882 56.886692 574.452913zM292.226939 16.821111a47.870152 47.870152 0 0 1-4.835369 69.202661L84.249191 257.650923a52.051324 52.051324 0 0 1-71.677232-4.636266A47.898595 47.898595 0 0 1 17.350441 183.811996L220.521263 12.184845A51.93755 51.93755 0 0 1 257.355397 0.15331c13.453703 0.8533 25.997218 6.88329 34.871542 16.667801z m215.685894 301.983006c-28.045139 0-50.771373 21.958263-50.771373 49.036329v196.145316c0 16.411811 8.476117 31.714331 22.584017 40.816201l152.371006 98.072658c23.323544 15.018087 54.895658 8.959654 70.454169-13.595919 15.55851-22.52713 9.244088-52.961511-14.079457-67.979598l-129.758545-83.538108v-169.92055c0-27.078066-22.754677-49.036329-50.799817-49.036329zM731.107771 17.133987a51.5109 51.5109 0 0 1 71.876336-4.750038l203.569029 174.841249c21.16185 18.146855 23.323544 49.718969 4.835369 70.482612-18.516618 20.763643-50.686043 22.896894-71.847893 4.721595L735.94314 87.645043a49.292319 49.292319 0 0 1-4.835369-70.482612z" fill="#707070" p-id="80802"></path></svg>
            时长: {{ readTime }} 分钟
        </p>
    </div>
</template>

<style>
.word {
  color: var(--vp-c-text-2);
  font-size: 15px;
}

.icon {
    display: inline-block;
    transform: translate(0px , 2px);
}
</style>